examples/uniform/CFDEM_MICRO/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -0.001); // please remember to add the keyword uniform

boundaryField
{

    inlet
    {

        type            zeroGradient ;
        value		 $internalField; 
    }

    outlet
    {
        type            zeroGradient ;
        value		 $internalField;
    }
    
    repeat_boundary
    {
    	type            slip;
    }
}

// ************************************************************************* //
