examples/uniform/CFDEM_MICRO/CFD/system/decomposeParDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM                                                 |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// If decomposeParDict is not defined, the CFDEM can not run

numberOfSubdomains  4;

 method          simple;


simpleCoeffs
{
    n           (2 2 1);
    delta       0.001;
}

